In [1]:
import numpy as np
import pandas as pd

In [2]:
# Creating a dictionary of and converting into a dataframe(Tabular form) with pandas
dict1 = {'Name': ['Priyang', 'Aadhya', 'Krisha', 'Vedant', 'Parshv', 'Mittal', 'Archana'],
         'Marks': [98, 89, 99, 87, 90, 83, 99],
         'Gender': ['Male', 'Female', 'Female', 'Male', 'Male', 'Female', 'Female']
         }
df1 = pd.DataFrame(dict1)

In [3]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [4]:
# Displaying the first 5 rows
df1.head()

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male

In [5]:
# Displaying the desired number of rows
# Displaying top 3 rows
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

In [6]:
# Displaying last 5 rows
df1.tail() # default is 5 rows

      Name  Marks  Gender
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [7]:
# Displaying last 3 rows
df1.tail(3) # 3 rows

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [8]:
# Finding number of rows and columns
df1.shape

(7, 3)

In [9]:
print("Number of rows: ", df1.shape[0])
print("Number of columns: ", df1.shape[1])

Number of rows:  7
Number of columns:  3